**Terraform Format and Style 🖌**
`success`

**Terraform Initialization ⚙️**
`success`

**Terraform Validate ✅**
`success`

**Terraform Plan 📖**
`success`

<details><summary>Show Plan</summary>

```
terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.hcloud_image.base: Refreshing state...
hcloud_floating_ip.bastion: Refreshing state... [id=369139]
hcloud_ssh_key.default: Refreshing state... [id=2415045]
hcloud_network.internal: Refreshing state... [id=389204]
data.google_dns_managed_zone.mhnet: Refreshing state... [id=projects/mhnet-home/managedZones/mhnet-me]
hcloud_server.bastion: Refreshing state... [id=8683930]
hcloud_network_subnet.internal: Refreshing state... [id=389204-10.0.0.0/24]
hcloud_server_network.bastion: Refreshing state... [id=8683930-389204]
hcloud_floating_ip_assignment.bastion: Refreshing state... [id=369139]
google_dns_record_set.bastion: Refreshing state... [id=mhnet-me/bastion.mhnet.me./A]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_dns_record_set.bastion must be replaced
-/+ resource "google_dns_record_set" "bastion" {
      ~ id           = "mhnet-me/bastion.mhnet.me./A" -> (known after apply)
        managed_zone = "mhnet-me"
      ~ name         = "bastion.mhnet.me." -> "bastion.fsn1.mhnet.me." # forces replacement
      ~ project      = "mhnet-home" -> (known after apply)
        rrdatas      = [
            "10.0.0.2",
        ]
        ttl          = 300
        type         = "A"
    }

  # hcloud_floating_ip_assignment.bastion must be replaced
-/+ resource "hcloud_floating_ip_assignment" "bastion" {
        floating_ip_id = 369139
      ~ id             = "369139" -> (known after apply)
      ~ server_id      = 8683930 -> (known after apply) # forces replacement
    }

  # hcloud_network.internal will be updated in-place
  ~ resource "hcloud_network" "internal" {
        id       = "389204"
        ip_range = "10.0.0.0/16"
        labels   = {}
      ~ name     = "mhnet" -> "internal"
    }

  # hcloud_server.bastion must be replaced
-/+ resource "hcloud_server" "bastion" {
      + backup_window = (known after apply)
        backups       = false
      ~ datacenter    = "fsn1-dc14" -> (known after apply)
      ~ id            = "8683930" -> (known after apply)
      ~ image         = "26591051" -> "26641539" # forces replacement
      ~ ipv4_address  = "168.119.246.101" -> (known after apply)
      ~ ipv6_address  = "2a01:4f8:1c17:401f::1" -> (known after apply)
      ~ ipv6_network  = "2a01:4f8:1c17:401f::/64" -> (known after apply)
        keep_disk     = false
      - labels        = {} -> null
        location      = "fsn1"
      ~ name          = "bastion.mhnet.me" -> "bastion.fsn1.mhnet.me."
        server_type   = "cx11"
        ssh_keys      = [
            "2415045",
        ]
      ~ status        = "running" -> (known after apply)
      ~ user_data     = "5VSDHLjjvq6u84bgOaQNPezFwzc=" -> "KZ3sOnKiHF2f+poklFiZfNu3Ksw=" # forces replacement
    }

  # hcloud_server_network.bastion must be replaced
-/+ resource "hcloud_server_network" "bastion" {
      - alias_ips   = [] -> null
      ~ id          = "8683930-389204" -> (known after apply)
        ip          = "10.0.0.2"
      ~ mac_address = "86:00:00:80:53:b0" -> (known after apply)
        network_id  = 389204
      ~ server_id   = 8683930 -> (known after apply) # forces replacement
    }

Plan: 4 to add, 1 to change, 4 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```
</details>
Pusher: @mhutter
Action: `pull_request`